tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "microsoft/git"
tap "ngrok/ngrok"
tap "romkatv/powerlevel10k"
brew "automake"
brew "sqlite"
brew "glib"
brew "cask"
brew "ffmpeg"
brew "guile"
brew "python@3.12"
brew "libheif"
brew "liblqr"
brew "imagemagick"
brew "mas"
brew "node"
brew "node@20"
brew "powerlevel10k"
brew "ruby-build"
brew "rbenv"
brew "s-search"
brew "starship"
brew "wget"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "jakehilborn/jakehilborn/displayplacer"
cask "adobe-digital-editions"
cask "android-file-transfer"
cask "anki"
cask "appcleaner"
cask "battery"
cask "brave-browser"
cask "cleaneronepro"
cask "coconutbattery"
cask "commander-one"
cask "cursor"
cask "docker-desktop"
cask "dotnet-sdk"
cask "duckduckgo"
cask "eqmac"
cask "github"
cask "google-chrome"
cask "iina"
cask "insomnia"
cask "keka"
cask "lm-studio"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "miniconda"
cask "ngrok"
cask "obsidian"
cask "postman"
cask "pycharm-ce"
cask "qbittorrent"
cask "scroll-reverser"
cask "send-anywhere"
cask "skim"
cask "tableplus"
cask "termius"
cask "visual-studio-code"
cask "windsurf"
cask "zen"
cask "zoom"
mas "AladinEbook", id: 1023251042
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "MYBOX", id: 975815190
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PhotoScape X", id: 929507092
mas "Time Timer", id: 332520417
mas "VOX", id: 461369673
mas "카카오톡", id: 869223134
mas "한컴오피스 하", id: 416746898
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "christian-kohler.path-intellisense"
vscode "continue.continue"
vscode "daiyy.quick-html-previewer"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "fivethree.vscode-ionic-snippets"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.vscode-pull-request-github"
vscode "google.geminicodeassist"
vscode "humao.rest-client"
vscode "ionic.ionic"
vscode "jmrog.vscode-nuget-package-manager"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mhutchie.git-graph"
vscode "misterj.vue-volar-extention-pack"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "nobelhuang.tslint-vue-tsx"
vscode "oderwat.indent-rainbow"
vscode "postman.postman-for-vscode"
vscode "pranaygp.vscode-css-peek"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.liveserver"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "syler.sass-indented"
vscode "vue.volar"
vscode "wallabyjs.quokka-vscode"
